app/controllers/api/v1/companies_controller.rb

INSERT INTO "companies" ("name", "established_year", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "my company 3"], ["established_year", "2024"], ["address", "nairobi, Kenya"], ["user_id", 3], ["created_at", "2023-09-11 14:26:09.082205"], ["updated_at", "2023-09-11 14:26:09.082205"]]
---
    def create
        # @company =Company.new(company_params)
        @company = current_user.companies.new(company_params)
        if @company.save

UPDATE "companies" SET "name" = ?, "established_year" = ?, "address" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "krunchy "], ["established_year", "2009"], ["address", "kisumu, Kenya"], ["updated_at", "2023-09-11 14:28:00.417478"], ["id", 3]]
---
    def update

        if @company.update(company_params)

DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]
---
    def destroy
        if @company.destroy

SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
    def set_company
    #   @company = Company.find(params[:id])
    @company = current_user.companies.find(params[:id])