app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"