app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"