app/controllers/loading_depots_controller.rb

  def index
    @loading_depots = LoadingDepot.all
---
SELECT "loading_depots".* FROM "loading_depots"

  def destroy
    @loading_depot.destroy
---
DELETE FROM "loading_depots" WHERE "loading_depots"."id" = ?  [["id", 1]]

  def destroy_all
    LoadingDepot.destroy_all
---
DELETE FROM "loading_depots" WHERE "loading_depots"."id" = ?  [["id", 2]]

  def set_loading_depot
    @loading_depot = LoadingDepot.find(params[:id])
---
SELECT "loading_depots".* FROM "loading_depots" WHERE "loading_depots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]