app/controllers/mainlines_controller.rb

SELECT "mainlines".* FROM "mainlines"
---
  def index
    @mainlines = Mainline.all