app/controllers/proforma_invoice_rows_controller.rb

SELECT "proforma_invoices".* FROM "proforma_invoices"
---
  def index
    @proforma_invoices = ProformaInvoice.all

INSERT INTO "proforma_invoices" ("customer_name", "customer_email", "customer_phone", "invoice_number", "date", "due_date", "subtotal", "tax", "total", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @proforma_invoice = ProformaInvoice.new(proforma_invoice_params)

    if @proforma_invoice.save

SELECT "proforma_invoices".* FROM "proforma_invoices" WHERE "proforma_invoices"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "proforma_invoices" SET "paid" = ?, "updated_at" = ? WHERE "proforma_invoices"."id" = ?  [["paid", 1], ["updated_at", "2023-11-28 12:12:26.675288"], ["id", 11]]
---
  def confirm_payment
    @proforma_invoice = ProformaInvoice.find(params[:id])
    if @proforma_invoice.update(paid: true)

SELECT "proforma_invoices".* FROM "proforma_invoices" WHERE "proforma_invoices"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def set_proforma_invoice
    @proforma_invoice = ProformaInvoice.find(params[:id])