app/controllers/proforma_invoice_rows_controller.rb

INSERT INTO "proforma_invoice_rows" ("description", "unit_price", "quantity", "total", "proforma_invoice_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
      @proforma_invoice_row = ProformaInvoiceRow.new(proforma_invoice_row_params)

      if @proforma_invoice_row.save